var demoLists = [{
    name: "赋值",
    code: [
        '变量 杨超越 赋值 "燃烧她的卡路里" 了',
        '打印 开始 杨超越 结束 了'
    ].join('\n')
},{
    name: "表达式",
    code: [
        '变量 蔡徐坤 赋值 "唱," 了',
        '蔡徐坤 赋值 蔡徐坤 加 "RAP," 加 "篮球" 了',
        '打印 开始 蔡徐坤 结束 了'
    ].join('\n')
},{
    name: "逻辑判断",
    code: [
        '变量 标识 赋值 1 了',
        '如果 开始 标识 等于 123 结束',
        '始',
        '   打印 开始 "值等于1" 结束 了',
        '终',
        '否则',
        '始',
        '   打印 开始 "值不等于1" 结束 了',
        '终'
    ].join('\n')
},{
    name: "函数",
    code: [
        '函数 你好函数 开始 结束',
        '始',
        '   打印 开始 "呵呵，你好函数！" 结束 了',
        '终',
        '你好函数 开始 结束 了'
    ].join('\n')
},{
    name: "循环",
    code:[
        '变量 计数器 赋值 1 了',
        '循环 开始 计数器 小于 10 结束',
        '始',
        '   打印 开始 计数器 结束 了',
        '   计数器 赋值 计数器 加 1 了',
        '终'
    ].join('\n')
},{
    name: "定时器",
    code:[
        '变量 计数器 赋值 0 了',
        '定时器 开始',
        '函数 开始 结束',
        '   始',
        '       计数器 赋值 计数器 加 1 了',
        '       打印 开始 计数器 结束 了',
        '   终',
        '逗号 1000 结束 了'
    ].join('\n')
}];